---
kind: method
id: M:Autodesk.Revit.DB.WorksetFilter.Dispose
source: html/e811b92a-22c3-c0b6-f747-6e8bdff15491.htm
---
# Autodesk.Revit.DB.WorksetFilter.Dispose Method

Releases all resources used by the WorksetFilter

## Syntax (C#)
```csharp
public void Dispose()
```